In [6]:
import pandas as pd
import numpy as np

In [7]:
city=["mumbai","bangluru","delhi","kolhapur","chennai"]
code=[77,44,88,66,55]
mydata=list(zip(city,code))

In [8]:
mydata

[('mumbai', 77),
 ('bangluru', 44),
 ('delhi', 88),
 ('kolhapur', 66),
 ('chennai', 55)]

In [10]:
df=pd.DataFrame(data=mydata,columns=["city","code"])

In [11]:
df

       city  code
0    mumbai    77
1  bangluru    44
2     delhi    88
3  kolhapur    66
4   chennai    55